Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.Create Method (RebarSpacing.Offset, RebarSpacing.Offset, Int32)
 Craetes a spacing defined by number of bars.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static RebarSpacing Create(
	RebarSpacing.Offset startOffset,
	RebarSpacing.Offset endOffset,
	int number
)
Public Shared Function Create (
	startOffset As RebarSpacing.Offset,
	endOffset As RebarSpacing.Offset,
	number As Integer
) As RebarSpacing
Parameters
startOffset
Type: Tekla.Structures.Model.RebarSpacing.Offset
The start offset.
endOffset
Type: Tekla.Structures.Model.RebarSpacing.Offset
The end offset.
number
Type: System.Int32
The number of bars.
Return Value
Type: RebarSpacing
A RebarSpacing instance.
See Also
Reference
RebarSpacing Class
Create Overload
Tekla.Structures.Model Namespace